# IsBoughtOut Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsBoughtOut Property
FabricationPart Class See Also
---
True if the fabrication part is bought out.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsBoughtOut { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsBoughtOut As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsBoughtOut {
	bool get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace